// Какое последнее значение выведет этот код? Почему?
//
//     let i = 3;
//
// while (i) {
//     alert( i-- );
// }

// Выведет 1 так как это последнее true значение

//

// Для каждого цикла запишите, какие значения он выведет. Потом сравните с ответом.
//
//     Оба цикла выводят alert с одинаковыми значениями или нет?
//
// Префиксный вариант ++i:
//
// let i = 0;
// while (++i < 5) alert( i );
//
// Постфиксный вариант i++
//
// let i = 0;
// while (i++ < 5) alert( i );

//

// При помощи цикла for выведите чётные числа от 2 до 10.

// for (let i = 2; i < 11; i += 1) {
//   if (i % 2 === 0) {
//     alert(i);
//   }
// }

//

// Перепишите код, заменив цикл for на while, без изменения поведения цикла.

// for (let i = 0; i < 3; i++) {
//     alert(`number ${i}!`);
// }

// let i = 0;
// while (i < 3) {
//     alert(`number ${i}!`);
//   i++;
// }

//
